backend/app/Http/Controllers/Admin/BlogController.php

select * from `blog` where `blog`.`deleted_at` is null order by `id` desc
---
    public function index(Builder $builder, Request $request)
    {
        $blog = Blog::orderBy('id', 'desc');
        if (request()->ajax()) {
            return DataTables::of($blog->get())->addIndexColumn()
                ->editColumn('description', function (Blog $blog) {
                    return Str::words($blog->description, 10, '....');
                })
                ->editColumn('image', function (Blog $blog) {
                    if (!$blog->image) {
                        return '<img class="img-thumbnail" src="' . asset('storage/blog/default.png') . '" width="50px" height="50px">';
                    } else {
                        return '<img class="img-thumbnail" src="' . asset('storage/blog' . '/' . $blog->image) . '" width="50px" height="50px">';
                    }
                })
                ->editColumn('action', function (Blog $blog) {
                    $action  = '';
                    $action .= '<a class="btn btn-warning btn-circle btn-sm" href=' . route('admin.blog.edit', [$blog->id]) . '><i class="fa fa-pencil" data-toggle="tooltip" title="Edit"></i></a>';
                    $action .= '<a class="btn btn-danger btn-circle btn-sm m-l-10 deleteblog ml-1 mr-1" data-id ="' . $blog->id . '" href="javascript:void(0)" data-toggle="tooltip" title="Delete"><i class="fa fa-trash"></i></a>';
                    $action .= '<a class="btn btn-primary btn-circle btn-sm" href=' . route('admin.blog.show', [$blog->id]) . '><i class="fa fa-eye"></i></a>';
                    return $action;
                })
                ->rawColumns(['action', 'description', 'image'])
                ->make(true);