backend/app/Http/Controllers/Admin/ContactController.php

select * from `contact` where `contact`.`deleted_at` is null order by `id` desc
---
    public function index(Builder $builder, Request $request)
    {
        $contact = Contact::orderBy('id', 'desc');
        if (request()->ajax()) {
            return DataTables::of($contact->get())->addIndexColumn()
                ->editColumn('message', function (Contact $contact) {
                    return Str::words($contact->message, 10, '....');
                })
                ->editColumn('action', function (Contact $contact) {
                    $action  = '';
                    $action .= '<a class="btn btn-danger btn-circle btn-sm m-l-10 deletecontact ml-1 mr-1" data-id ="' . $contact->id . '" href="javascript:void(0)" data-toggle="tooltip" title="Delete"><i class="fa fa-trash"></i></a>';
                    $action .= '<a href="javascript:void(0)" class="btn btn-primary btn-circle btn-sm Showcontact" data-id="' . $contact->id . '" data-toggle="tooltip" title="Show"><i class="fa fa-eye"></i></a>';
                    return $action;
                })
                ->rawColumns(['action', 'description', 'image', 'status'])
                ->make(true);