backend/app/Http/Controllers/Admin/MainController.php

    public function dashboard()
    {
        $TotalUser = User::where('user_type', 'user')->count();
        $TotalBlog = Blog::count();
        $TotalCms = Cms::count();
        $TotalFaq = Faq::count();
        $TotalBrand = Brand::count();
        $TotalCategories = Categories::count();
        $TotalProduct = Product::count();
        $TotalPromo = Promo::count();
        $TotalSetting = Setting::count();
---
select count(*) as aggregate from `settings`

    public function maintenancemode_down()
    {
        $id = "1";
        $data = ['meta_value' => "1"];
        SiteSetting::where('id', $id)->update($data);
---
update `site_setting` set `meta_value` = '0', `site_setting`.`updated_at` = '2023-01-05 10:57:59' where `id` = '1'