backend/app/Http/Controllers/Admin/MainController.php

select count(*) as aggregate from `settings`
---
    public function dashboard(){
        $totalSetting = Setting::count();