backend/app/Http/Controllers/Admin/OrderController.php

    public function index(Builder $builder, Request $request)
    {
        $order = Order::orderBy('id', 'desc');
        if (isset($request->start_date) || isset($request->end_date)) {
            $start_date = $request->start_date;
            $end_date = $request->end_date;
            $order->whereDate('created_at', '>=', $start_date)->whereDate('created_at', '<=', $end_date);
        }
        if (request()->ajax()) {
            return DataTables::of($order->get())->addIndexColumn()
                ->editColumn('status', function (Order $order) {
                    if ($order->status == 'processing') {
                        return '<div class="project-completion">
                                <small>Completion with: 25% Processing</small>
                                <div class="progress progress-mini">
                                <div style="width: 25%;" class="progress-bar"></div>
                                </div>
                                </div>';
                    } elseif ($order->status == 'accepted') {
                        return '<div class="project-completion">
                                <small>Completion with: 50% Accepted</small>
                                <div class="progress progress-mini">
                                <div style="width: 50%;" class="progress-bar"></div>
                                </div>
                                </div>';
                    } elseif ($order->status == 'ontheway') {
                        return '<div class="project-completion">
                                <small>Completion with: 75% On The Way</small>
                                <div class="progress progress-mini">
                                <div style="width: 75%;" class="progress-bar"></div>
                                </div>
---
select * from `order` where `order`.`deleted_at` is null order by `id` desc

    public function view($id)
    {
        try {
            $order = Order::with(['user_details', 'UserAddressDetails'])->where('id', $id)->first();
            $ProductOrder = OrderProduct::where('order_id', $id)->get();
---
select * from `order` where `id` = '3' and `order`.`deleted_at` is null limit 1
select * from `order_product` where `order_id` = '3' and `order_product`.`deleted_at` is null

    public function downloadPdf($id)
    {
        try {
            $order = Order::with(['user_details', 'UserAddressDetails'])->where('id', $id)->first();
            $ProductOrder = OrderProduct::where('order_id', $id)->get();
---
select * from `order` where `id` = '1' and `order`.`deleted_at` is null limit 1
select * from `order_product` where `order_id` = '1' and `order_product`.`deleted_at` is null