backend/app/Http/Controllers/Admin/ProductController.php

select * from `product` where `product`.`deleted_at` is null order by `id` desc
---
    public function index(Builder $builder, Request $request)
    {
        $product = Product::orderBy('id', 'desc');
        if (request()->ajax()) {
            return DataTables::of($product->get())->addIndexColumn()
                ->editColumn('description', function (Product $product) {
                    return Str::words($product->description, 10, '....');
                })
                ->editColumn('price', function (Product $product) {
                    return '₹' . $product->price;
                })
                ->editColumn('action', function (Product $product) {
                    $action  = '';
                    $action .= '<a class="btn btn-danger btn-circle btn-sm m-l-10 deleteproduct ml-1 mr-1" data-id ="' . $product->id . '" href="javascript:void(0)" data-toggle="tooltip" title="Delete"><i class="fa fa-trash"></i></a>';
                    $action .= '<a class="btn btn-primary btn-circle btn-sm" href=' . route('admin.product.show', [$product->id]) . '><i class="fa fa-eye"></i></a>';
                    return $action;
                })
                ->rawColumns(['action', 'description', 'price'])
                ->make(true);