backend/app/Http/Controllers/Admin/PromoController.php

    public function index(Builder $builder, Request $request)
    {
        $promo = Promo::orderBy('id', 'desc')->groupBy('code');
        if (request()->ajax()) {
            return DataTables::of($promo->get())->addIndexColumn()
                ->editColumn('user_id', function (Promo $promo) {
                    $promos = array();
                    $promoname = '';
                    $allpromo = PromoUser::where('promo_id', $promo->id)->get();
                    if (!empty($allpromo)) {
                        foreach ($allpromo as $code) {
                            $promoname = User::where('id', $code->user_id)->first()->email;
                            array_push($promos, $promoname);
                        }
                    }
                    return "<span class='badge badge-success'>" . implode("</span> <span class='badge badge-success'>", $promos) . "</span>";
                })
                ->editColumn('start_date', function (Promo $promo) {
                    return $promo->start_date;
                })
                ->editColumn('end_date', function (Promo $promo) {
                    return $promo->end_date;
                })
                ->editColumn('action', function (Promo $promo) {
                    $action  = '';
                    $action .= '<a class="btn btn-warning btn-circle btn-sm" href=' . route('admin.promo.edit', [$promo->id]) . '><i class="fa fa-pencil" data-toggle="tooltip" title="Edit"></i></a>';
                    $action .= '<a class="btn btn-danger btn-circle btn-sm m-l-10 deletepromo ml-1 mr-1" data-id ="' . $promo->id . '" href="javascript:void(0)" data-toggle="tooltip" title="Delete"><i class="fa fa-trash"></i></a>';
                    $action .= '<a href="javascript:void(0)" class="btn btn-primary btn-circle btn-sm Showpromo" data-id="' . $promo->id . '" data-toggle="tooltip" title="Show"><i class="fa fa-eye"></i></a>';
                    return $action;
                })
                ->rawColumns(['action', 'start_date', 'end_date', 'user_id'])
                ->make(true);
---
select * from `promo` where `promo`.`deleted_at` is null group by `code` order by `id` desc
select * from `promo_user` where `promo_id` = 1 and `promo_user`.`deleted_at` is null
select * from `users` where `id` = '2' and `users`.`deleted_at` is null limit 1

    public function create()
    {
        $promo_list = array();
        $user_list = User::where('user_type', 'user')->pluck('email', 'id');
---
select `email`, `id` from `users` where `user_type` = 'user' and `users`.`deleted_at` is null

            } else {
                $filename = 'default.png';
            }
            $promo = Promo::create([
                'code'            => @$request->get('code'),
                'start_date'      => @$request->get('start_date'),
                'end_date'        => @$request->get('end_date'),
                'status'          => @$request->get('status'),
                'discount'        => @$request->get('discount'),
                'description'     => @$request->get('description'),
                'promocodeimages' => @$filename,
            ]);
            foreach ($request->get('user_id') as $val) {
                PromoUser::create([
                    'user_id'     => @$val,
                    'promo_id'     => @$promo->id,
                ]);
                $UserEmail = User::where('id', $val)->first();
---
insert into `promo` (`code`, `start_date`, `end_date`, `status`, `discount`, `description`, `promocodeimages`, `updated_at`, `created_at`) values ('Demo', '2023-01-02', '2023-01-31', 'active', '20', 'Description Description Description Description Description Description Description Description Description Description Description Description Description Description Description Description Description Description Description Description', 'default.png', '2023-01-02 13:17:49', '2023-01-02 13:17:49')
insert into `promo_user` (`user_id`, `promo_id`, `updated_at`, `created_at`) values ('2', 1, '2023-01-02 13:17:49', '2023-01-02 13:17:49')
select * from `users` where `id` = '2' and `users`.`deleted_at` is null limit 1