backend/app/Http/Controllers/API/CommonController.php

select * from `product_image` where `product_image`.`product_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20) and `product_image`.`deleted_at` is null
select * from `product` where `product`.`deleted_at` is null order by `id` desc
---
    public function getproducts(Request $request)
    {
        try {
            $product = Product::with(['productimage'])->orderBy('id', 'desc')->get();

select * from `product_image` where `product_image`.`product_id` in (13, 14, 15, 16, 17, 18, 19, 20) and `product_image`.`deleted_at` is null
select * from `product` where `product`.`deleted_at` is null order by `id` desc limit 8
---
    public function gettopproducts(Request $request)
    {
        try {
            $product = Product::with(['productimage'])->orderBy('id', 'desc')->limit(8)->get();

select * from `brand` where `brand`.`deleted_at` is null order by `id` desc
---
    public function getbrand(Request $request)
    {
        try {
            $brand = Brand::orderBy('id', 'desc')->get();

select * from `categories` where `categories`.`deleted_at` is null order by `id` desc
---
    public function getcategories(Request $request)
    {
        try {
            $categories = Categories::orderBy('id', 'desc')->get();

select * from `blog` where `blog`.`deleted_at` is null order by `id` desc
---
    public function getblog(Request $request)
    {
        try {
            $blog = Blog::orderBy('id', 'desc')->get();

select * from `order` where `user_id` = '2' and `order`.`deleted_at` is null
---
    public function userorder($user_id)
    {
        try {
            $order_list = Order::with(['OrderProductDetails'])->where('user_id', $user_id)->get();

select * from `order` where `id` = '3' and `order`.`deleted_at` is null limit 1
---
    public function singleuserorder($id)
    {
        try {
            $order = Order::with(['OrderProductDetails'])->where('id', $id)->first();

select * from `user_address` where `user_id` = '2' and `user_address`.`deleted_at` is null
---
    public function useraddress($id)
    {
        try {
            $alluserAddress = UserAddress::where('user_id', $id)->get();

select * from `user_address` where `id` = '1' and `user_address`.`deleted_at` is null limit 1
---
    public function usereditaddress($address_id)
    {
        try {
            $usereditaddress = UserAddress::where('id', $address_id)->first();

update `users` set `address_id` = '2', `users`.`updated_at` = '2023-01-04 12:35:55' where `id` = '2' and `users`.`deleted_at` is null
select * from `users` where `id` = '2' and `users`.`deleted_at` is null limit 1
select * from `user_address` where `user_id` = '2' and `user_address`.`deleted_at` is null
---
    public function useraddressselect($address_id, $user_id)
    {
        try {
            User::where('id', $user_id)->update([
                'address_id' => $address_id
            ]);
            $userset = User::where('id', $user_id)->first();
            $alluserAddress = UserAddress::where('user_id', $user_id)->get();

insert into `order` (`invoice`, `comment`, `grandtotal`, `maintotal`, `promototal`, `user_id`, `address_id`, `promo_id`, `status`, `payment_mode`, `updated_at`, `created_at`) values (57132711942, 'Additional comments', '1400.00', '1400.00', 0, 2, '1', '', 'processing', 'cod', '2023-01-04 12:29:21', '2023-01-04 12:29:21')
---
            $emailcontent = array(
                'text' => @$text,
                'invoice' => @$order_details->invoice,
                'date' => date_format($order_details->created_at, 'd.m.Y'),