backend/app/Http/Controllers/API/CommonController.php

select * from `settings` where `code` = 'application_logo' limit 1
---
    public function sitelogo(Request $request)
    {
        try {
            $setting = Setting::where('code', 'application_logo')->first();

select * from `user_address` where `user_id` = 2 and `user_address`.`deleted_at` is null
---
    public function addaddress(Request $request)
    {
        try {
            UserAddress::updateOrCreate(['id'   => $request->address_id,], [
                'user_id' => $request->user_id,
                'zip' => $request->zip,
                'states' => $request->states,
                'country' => $request->country,
                'optional' => $request->optional,
                'street_address' => $request->street_address,
                'city' => $request->city,
            ]);

select * from `order` where `invoice` = 'fdgfdg' and `order`.`deleted_at` is null limit 1
---
    public function tracknow(Request $request, $id)
    {
        try {
            $TrackOrder = Order::where('invoice', $id)->first();